Revit 2027 API
PathOfTravel.GetCurves Method
 Gets the array of curves representing the path of travel.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetCurves()
Public Function GetCurves As IList(Of Curve)
public:
IList<Curve^>^ GetCurves()
member GetCurves : unit -> IList<Curve>
Return Value
IList<Curve>
 The array of curves.
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace